[
  {
    "id": 1,
    "title": "Server Client Database",
    "year": 2021,
    "abstract": "Developed a small database server with Python. Implemented a SocketServer class in its standard libraries for concurrency and thread control. Send requests to the server and ask for the specific task to be performed, such as: Find, add, delete a customer, update the customer’s age, address, phone number, etc.",
    "link": "https://github.com/quannguyen10800/Server_Client_Database"
  },
  {
    "id": 2,
    "title": "Spotify-API-Oauth",
    "year": 2024,
    "abstract": "Developed with Javascript, REST API and Node.js. Generated API that responds to a specific command with keyword triggers by sending corresponding images. Implemented image retrieval and delivery functionality, enabling the bot to quickly respond with an image upon user request.",
    "link": "https://github.com/quannguyen10800/Spotify-API-Oauth"
  },
  {
    "id": 3,
    "title": "Weather-App-API",
    "year": 2024,
    "abstract": "This Python application uses the OpenWeatherMap API to fetch current weather data for a given city. Users can input city names and receive information such as temperature, humidity, and a description of the weather conditions. The app also features an interactive loop that allows users to check multiple cities or exit the program at any time.",
    "link": "https://github.com/quannguyen10800/weather-app-api"
  },
  {
    "id": 4,
    "title": "Digital Socio-Ecologies",
    "year": 2023,
    "abstract": "Nowadays, the amount of digitally available information has tremendously grown, with real-world data graphs outreaching the millions or even billions of vertices. Hence, community detection, where groups of vertices are formed according to a well-defined similarity measure, has never been more essential affecting a vast range of scientific fields such as bio-informatics, sociology, discrete mathematics, nonlinear dynamics, digital marketing, and computer science. Even if an impressive amount of research has yet been published to tackle this NP-hard class problem, the existing methods and algorithms have virtually been proven inefficient and severely unscalable. In this regard, the purpose of this manuscript is to combine the network topology properties expressed by the loose similarity and the local edge betweenness, which is a currently proposed Girvan–Newman’s edge betweenness measure alternative, along with the intrinsic user content information, in order to introduce a novel and highly distributed hybrid community detection methodology. The proposed approach has been thoroughly tested on various real social graphs, roundly compared to other classic divisive community detection algorithms that serve as baselines and practically proven exceptionally scalable, highly efficient, and adequately accurate in terms of revealing the subjacent network hierarchy.",
    "link": "https://docs.google.com/presentation/d/14zaVHbnUjJ9OUeb4IHnj2FLCxnoASu6cWBU0W6fOLyk/edit#slide=id.p"
  }
]